app/controllers/articles_controller.rb

	def create
		@article = Article.new(article_params)

	  	if @article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-23 17:59:48.023504"], ["text", "cant find?"], ["title", "still"], ["updated_at", "2014-11-23 17:59:48.023504"]]

	def update
	  @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 7]]